import random
people = ("10.03.1990", "11.04.1980", "01.12.1977", "25.05.1978", "23.07.2000", "19.09.1989", "30.03.2003", "17.08.2001", "20.02.1988", "22.05.1996")
d_dict = {
    "01":"первое",
    "02":"второе",
    "03":"третье",
    "04":"четвертое",
    "05":"пятое",
    "06":"шестое",
    "07":"седьмое",
    "08":"восьмое",
    "09":"девятое",
    "10":"десятое",
    "11":"одинадцатое",
    "12":"двенадцатое",
    "13":"тринадцатое",
    "14":"четырнадцатое",
    "15":"пятнадцатое",
    "16":"шестнадцатое",
    "17":"семнадцатое",
    "18":"восемнадцатое",
    "19":"девятнадцатое",
    "20":"двадцатое",
    "21":"двадцать первое",
    "22":"двадцать второе",
    "23":"двадцать третье",
    "24":"двадцать четвертое",
    "25":"двадцать пятое",
    "26":"двадцать шестое",
    "27":"двадцать седьмое",
    "28":"двадцать восьмое",
    "29":"двадцать девятое",
    "30":"тридцатое",
    "31":"тридцать первое"
}
m_dict = {
    "01":"января",
    "02":"февраля",
    "03":"марта",
    "04":"апреля",
    "05":"мая",
    "06":"июня",
    "07":"июля",
    "08":"августа",
    "09":"сентября",
    "10":"октября",
    "11":"ноября",
    "12":"декабря"
}
some = random.sample(people, 5)
game = True
correct = incorrect = 0

def start_game():
    global game, correct, incorrect, some, m_dict, d_dict
    print("Начало игры!")
    while game:
        for man in some:
            d,m,y = man.split(".")
            if (input("введите дату рождения в формате 'dd.mm.yyyy': ") != man):
                incorrect +=1
                print("Неверно! Правильный ответ:", d_dict[d], m_dict[m], y, "года")
            else:
                correct +=1
        print("Количество верных ответов:", str(correct), "\nКоличество неверных ответов:", str(incorrect))
        correct = incorrect = 0
        game = True if input("Хотите еще сыграть ('да'/'нет')?") in ("да", "Да", "ДА", "yes", "Yes", "YES") else False
    print("До свидания!")